In [2]:
data ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
import pandas as pd
df = pd.DataFrame(data)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df.shape

(7, 3)

In [11]:
print("number of rows =" , df.shape[0])
print("number of columns =" , df.shape[1])

number of rows = 7
number of columns = 3

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [16]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [19]:
df.describe(include="all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [23]:
df["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [24]:
df["Gender"].nunique()

2

In [25]:
df["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [29]:
filt = df["Marks"] >= 90
df.loc[filt , "Marks"].count()

4

In [30]:
filt = (df["Marks"] >= 90) & (df["Marks"] <=100)
len(df[filt])

4

In [31]:
sum(df["Marks"].between(90,100))

4

In [32]:
df["Marks"].mean()

92.14285714285714

In [33]:
df["Marks"].min()

83

In [34]:
df["Marks"].max()

99

In [36]:
def fifty_percentile(x):
    return x/2

In [37]:
df["Marks"].apply(fifty_percentile)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [38]:
df["50_pointer"] = df["Marks"].apply(fifty_percentile)

In [39]:
df

      Name  Marks  Gender  50_pointer
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [40]:
df["50_pointer"] = df["Marks"].apply(lambda x:x/2)

In [41]:
df

      Name  Marks  Gender  50_pointer
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [1]:
def decoding(String):
    if String == "Male":
        return 1
    elif String == "Female":
        return 2
    else:
        return String

In [5]:
df = df.applymap(decoding)

In [6]:
df

      Name  Marks  Gender
0  Priyang     98       1
1   Aadhya     89       2
2   Krisha     99       2
3   Vedant     87       1
4   Parshv     90       1
5   Mittal     83       2
6  Archana     99       2

In [8]:
df["Gender"] = df["Gender"].map({1 : "Male" , 2 : "Female"})

In [9]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [10]:
df["Gender_numeric"] = df["Gender"].map({"Male" : 1 , "Female" : 0})

In [11]:
df

      Name  Marks  Gender  Gender_numeric
0  Priyang     98    Male               1
1   Aadhya     89  Female               0
2   Krisha     99  Female               0
3   Vedant     87    Male               1
4   Parshv     90    Male               1
5   Mittal     83  Female               0
6  Archana     99  Female               0

In [13]:
df.drop(columns = ["Gender_numeric"] , inplace=True)

In [14]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [15]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [17]:
df.sort_values(by="Marks" , inplace=True)

In [18]:
df

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [21]:
filt = df["Gender"] == "Female"
df.loc[filt , ["Name","Marks"]]

      Name  Marks
5   Mittal     83
1   Aadhya     89
2   Krisha     99
6  Archana     99